OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example7/cylinderAndBackground/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

touch post.foam

./Allrun.pre

# Run it for a bit
# runApplication $(getApplication)

#------------------------------------------------------------------------------
